[
  {
    "id": "odas-original-plan-for-one-piece",
    "title": "Oda's Original Plan for One Piece",
    "overview": "Eiichiro Oda originally intended One Piece to run for only five years. The plan was simple, with a straightforward treasure hunt and fewer characters. But as the story developed, Oda expanded the world, creating deeper lore, richer character arcs, and more complex plots. What started as a short pirate adventure turned into one of the longest running and most beloved manga and anime series in history, captivating fans across generations.",
    "card_thumbnail": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_bts_card_1.png",
    "category": "Behind the Scenes",
    "date_created": "2024-07-02",
    "read_duration": 4,
    "details": [
      {
        "header_title": "One Piece Was Supposed to End in Five Years",
        "details": "When Eiichiro Oda began writing One Piece in 1997, he planned for the series to end in about five years. The original concept was much simpler, focusing solely on Luffy's journey to find the legendary treasure with a relatively small cast and linear story progression.\n\nHowever, Oda quickly realized the story had much more potential. As the world grew and fan interest skyrocketed, he extended the timeline to accommodate deeper plotlines, complex characters, and a richer lore that fans came to love.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_bts_card_1_1.png"
      },
      {
        "header_title": "Oda Considered Romance But Changed Course",
        "details": "In the early concept phase, Oda thought about including romantic elements, especially involving Nami and Luffy. He believed that a romantic arc might help humanize the characters further.\n\nHowever, he later felt romance would take away from the sense of adventure and friendship that defines the series. Instead, he focused on developing emotional bonds through loyalty, shared dreams, and personal struggles.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_bts_card_1_2.png"
      },
      {
        "header_title": "The Final Chapter Was Always in Oda's Head",
        "details": "Even with changes to the middle of the story, Oda confirmed that he always had a clear idea of how One Piece would end. Key parts of the conclusion, such as the nature of the treasure and the fate of important characters, have been set since the early days.\n\nThis approach allowed him to carefully place clues and build long-term mysteries, keeping fans engaged for over two decades. The anticipation of that final moment has fueled endless fan theories and discussions across the world.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_bts_card_1_3.png"
      },
      {
        "header_title": "The World Expanded Beyond Expectations",
        "details": "The original plan for One Piece did not include massive worldbuilding elements like the Revolutionary Army, the Celestial Dragons, or the complex political systems. These were added later as Oda developed a deeper narrative structure around the pirate world.\n\nAs he introduced new islands and lore, each arc built upon the last with increasing scale and depth. What began as a treasure hunt turned into a saga filled with wars, power struggles, ancient secrets, and ideological battles.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_bts_card_1_4.png"
      },
      {
        "header_title": "Audience Reactions Changed the Series",
        "details": "Fan reactions have greatly influenced Oda's decisions over the years. Characters like Trafalgar Law and Vivi became more prominent because of their popularity, even though their original roles were smaller.\n\nOda pays close attention to fan feedback from polls and letters, using it to fine-tune his storytelling. This two-way relationship has helped keep the series fresh while giving fans a sense of connection to the evolving world of One Piece.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_bts_card_1_5.png"
      }
    ]
  },
  {
    "id": "5-hidden-anime-easter-eggs-you-definitely-missed",
    "title": "5 Hidden Anime Easter Eggs You Definitely Missed",
    "overview": "Anime creators love sneaking in subtle references, cameos, and nods to other series or pop culture moments. These hidden gems, often called Easter eggs, are easy to miss unless you're a hardcore fan or happen to pause at just the right frame. From surprising character appearances to background details with secret meaning, these clever inclusions add another layer of enjoyment for eagle-eyed viewers who catch them.",
    "card_thumbnail": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_tva_card_1.png",
    "category": "Trivia",
    "date_created": "2024-07-03",
    "read_duration": 4,
    "details": [
      {
        "header_title": "Attack on Titan Hints at Creator Isayama’s Love for UFC",
        "details": "In Attack on Titan, the Armored Titan's fighting style is inspired by mixed martial arts, especially UFC legend Brock Lesnar. Hajime Isayama has publicly shared that he's a fan of Lesnar and modeled the Titan’s body structure and combat stance after him.\n\nThis small but fascinating tribute adds realism to the Titan's movements and reflects Isayama’s personal interests. Most viewers may never connect the dots unless they’re familiar with professional fighting techniques.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_tva_card_1_1.png"
      },
      {
        "header_title": "Dragon Ball Super Teased Broly Long Before His Debut",
        "details": "In Dragon Ball Super, a brief scene shows a Saiyan in a tank during the Tournament of Power arc that closely resembles Broly, long before his official reintroduction in the 2018 movie. It was so subtle that many fans dismissed it as a generic background figure.\n\nLater, when the Broly movie was released, fans went back and realized this was an intentional teaser. The foreshadowing shows how carefully planned the Dragon Ball universe had become in its newer installments.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_tva_card_1_2.png"
      },
      {
        "header_title": "Studio Ghibli Loves Reusing Background Characters",
        "details": "In many Studio Ghibli films, you’ll find the same background characters appearing across different movies. A prime example is the little girl in a red hood who shows up briefly in Spirited Away and My Neighbor Totoro, despite having no named role.\n\nThis quirky reuse has become a fun game for fans who enjoy spotting these recurring extras. It's a subtle way Studio Ghibli connects its magical worlds and rewards observant viewers who look beyond the main cast.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_tva_card_1_3.png"
      },
      {
        "header_title": "One Piece Paid Tribute to Naruto After Its Ending",
        "details": "After Naruto ended, One Piece featured a small tribute in one of its manga chapters. In the background of a celebratory panel, you can see a character wearing Naruto’s signature orange jumpsuit and Konoha headband, walking away with a smile.\n\nIt was Oda’s way of honoring his fellow mangaka, Masashi Kishimoto. The moment was subtle and easy to miss but served as a heartfelt nod to one of the most iconic friendships in the manga industry.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_tva_card_1_4.png"
      },
      {
        "header_title": "Death Note’s Ryuk Shows Up in Multiple Anime",
        "details": "The Shinigami Ryuk from Death Note makes surprising cameo appearances in other anime, including as a background shadow in Bakuman, which was also written by the same creators. His silhouette can be spotted briefly if you pause at the right moment.\n\nThese hidden cameos serve as Easter eggs that link different works by the same artists. They are easy to miss during a normal viewing but become fan favorites once discovered through rewatching or community discussion.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_tva_card_1_5.png"
      }
    ]
  },
  {
    "id": "top-5-saddest-anime-endings",
    "title": "Top 5 Saddest Anime Endings",
    "overview": "Some anime endings stay with you forever, not because they wrapped up perfectly, but because they left you emotionally wrecked. Whether it's the loss of a beloved character, a bittersweet goodbye, or the sheer tragedy of fate, these anime finales go beyond storytelling and hit you where it hurts. Here's a look at five of the most heartbreaking anime endings that fans continue to talk about long after the credits roll.",
    "card_thumbnail": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_lnr_card_1.png",
    "category": "Lists & Rankings",
    "date_created": "2025-07-04",
    "read_duration": 3,
    "details": [
      {
        "header_title": "Grave of the Fireflies Leaves Nothing but Tears",
        "details": "Grave of the Fireflies is a harrowing film that follows two siblings trying to survive during World War II. The final scenes, showing the inevitable fate of Seita and Setsuko, are utterly soul-crushing and offer no happy resolution.\n\nThe film’s realism and emotional weight make it more than just a sad ending—it’s a painful reminder of war's impact on innocence. It’s widely regarded as one of the most powerful and tragic anime experiences ever created.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_lnr_card_1_1.png"
      },
      {
        "header_title": "Your Lie in April’s Goodbye Hurts Deeply",
        "details": "Your Lie in April begins as a musical love story and ends as a devastating lesson in loss. The emotional buildup between Kousei and Kaori makes the reveal of her terminal illness all the more heartbreaking.\n\nKaori’s letter at the end, revealing her feelings and her secret, brings everything full circle in a way that is beautiful and crushing. It's a farewell that feels personal, intimate, and almost impossible to move on from.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_lnr_card_1_2.png"
      },
      {
        "header_title": "Clannad After Story Breaks You Completely",
        "details": "Clannad After Story is infamous for its emotional toll. It takes the viewer through Tomoya’s adult life, filled with love, tragedy, and an unimaginable loss that devastates both the character and the audience.\n\nWhile the story does offer a supernatural twist that brings some healing, the journey to get there is brutally emotional. Watching Tomoya lose everything he holds dear makes this one of the most tear-inducing endings in anime history.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_lnr_card_1_3.png"
      },
      {
        "header_title": "Anohana’s Final Message Will Break You",
        "details": "Anohana: The Flower We Saw That Day ends with a farewell letter from Menma, a ghost whose death shaped the lives of her childhood friends. The moment they all finally hear her goodbye is raw and emotionally overwhelming.\n\nYears of suppressed grief, guilt, and longing come pouring out in the final episode, making it nearly impossible to watch without crying. It's a powerful reminder of how loss lingers long after life moves on.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_lnr_card_1_4.png"
      },
      {
        "header_title": "Angel Beats Ends on a Bittersweet Note",
        "details": "Angel Beats is set in a limbo-like afterlife where characters must come to terms with their regrets before they move on. When the final group members find peace and disappear, it leaves the audience with a heavy mix of closure and sorrow.\n\nThe last scene, especially the quiet goodbye between Otonashi and Kanade, hits hard. It’s a gentle but crushing conclusion to a story about redemption, connection, and letting go of pain.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_lnr_card_1_5.png"
      }
    ]
  }
]
