[
  {
    "id": "1",
    "title": "Oda's Original Plan for One Piece",
    "overview": "Eiichiro Oda originally intended One Piece to run for only five years. The plan was simple, with a straightforward treasure hunt and fewer characters. But as the story developed, Oda expanded the world, creating deeper lore, richer character arcs, and more complex plots. What started as a short pirate adventure turned into one of the longest running and most beloved manga and anime series in history, captivating fans across generations.",
    "card_thumbnail": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_bts_card_1.png",
    "category": "Behind the Scenes",
    "date_created": "2024-05-02",
    "read_duration": 4,
    "details": [
      {
        "header_title": "One Piece Was Supposed to End in Five Years",
        "details": "When Eiichiro Oda began writing One Piece in 1997, he planned for the series to end in about five years. The original concept was much simpler, focusing solely on Luffy's journey to find the legendary treasure with a relatively small cast and linear story progression.\n\nHowever, Oda quickly realized the story had much more potential. As the world grew and fan interest skyrocketed, he extended the timeline to accommodate deeper plotlines, complex characters, and a richer lore that fans came to love.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_bts_card_1_1.png"
      },
      {
        "header_title": "Oda Considered Romance But Changed Course",
        "details": "In the early concept phase, Oda thought about including romantic elements, especially involving Nami and Luffy. He believed that a romantic arc might help humanize the characters further.\n\nHowever, he later felt romance would take away from the sense of adventure and friendship that defines the series. Instead, he focused on developing emotional bonds through loyalty, shared dreams, and personal struggles.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_bts_card_1_2.png"
      },
      {
        "header_title": "The Final Chapter Was Always in Oda's Head",
        "details": "Even with changes to the middle of the story, Oda confirmed that he always had a clear idea of how One Piece would end. Key parts of the conclusion, such as the nature of the treasure and the fate of important characters, have been set since the early days.\n\nThis approach allowed him to carefully place clues and build long-term mysteries, keeping fans engaged for over two decades. The anticipation of that final moment has fueled endless fan theories and discussions across the world.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_bts_card_1_3.png"
      },
      {
        "header_title": "The World Expanded Beyond Expectations",
        "details": "The original plan for One Piece did not include massive worldbuilding elements like the Revolutionary Army, the Celestial Dragons, or the complex political systems. These were added later as Oda developed a deeper narrative structure around the pirate world.\n\nAs he introduced new islands and lore, each arc built upon the last with increasing scale and depth. What began as a treasure hunt turned into a saga filled with wars, power struggles, ancient secrets, and ideological battles.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_bts_card_1_4.png"
      },
      {
        "header_title": "Audience Reactions Changed the Series",
        "details": "Fan reactions have greatly influenced Oda's decisions over the years. Characters like Trafalgar Law and Vivi became more prominent because of their popularity, even though their original roles were smaller.\n\nOda pays close attention to fan feedback from polls and letters, using it to fine-tune his storytelling. This two-way relationship has helped keep the series fresh while giving fans a sense of connection to the evolving world of One Piece.",
        "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/a_bts_card_1_5.png"
      }
    ]
  }
]
