[
  {
    "id": "1",
    "anime": "One Piece",
    "title": "Anime Fact 1",
    "preview": "Luffy only bathes once a week, focusing on becoming the Pirate King in One Piece.",
    "fullText": "In One Piece, Monkey D. Luffy takes a bath only once a week. Eiichiro Oda revealed this quirky hygiene detail to highlight Luffy’s focus on adventure and his carefree nature. While others might worry about cleanliness, Luffy's sights are set on becoming the Pirate King, no matter how sweaty the journey gets.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_1.png"
  },
  {
    "id": "2",
    "anime": "Fairy Tail",
    "title": "Anime Fact 2",
    "preview": "Fairy Tail’s Gajeel writes songs, but Gray says he can't sing or play instruments well.",
    "fullText": "In Fairy Tail, Gray Fullbuster revealed that fellow guild member Gajeel Redfox is actually a talented songwriter. However, Gray also pointed out that Gajeel’s singing voice and instrument-playing skills leave much to be desired. Despite this, Gajeel's musical passion adds a fun layer to his rough-and-tough image.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_2.png"
  },
  {
    "id": "3",
    "anime": "YuYu Hakusho",
    "title": "Anime Fact 3",
    "preview": "Yu Yu Hakusho's Hiei and Kurama were once meant to be a couple, not just friends.",
    "fullText": "In early drafts of Yu Yu Hakusho, creator Yoshihiro Togashi considered making Hiei and Kurama a romantic couple. Due to content restrictions and editorial decisions at the time, he shifted their relationship to a strong and loyal friendship instead. Their bond remains one of the most emotionally rich in the series.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_3.png"
  },
  {
    "id": "4",
    "anime": "Pokemon",
    "title": "Anime Fact 4",
    "preview": "Vullaby wears a broken skull as a diaper, possibly explaining its Dark-type origin.",
    "fullText": "In the Pokémon universe, Vullaby is a Dark-type Pokémon that wears what appears to be a broken human skull as a diaper. This eerie and unsettling design likely plays a role in its typing, giving it a grim backstory compared to most other baby Pokémon.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_4.png"
  },
  {
    "id": "5",
    "anime": "Hunter x Hunter",
    "title": "Anime Fact 5",
    "preview": "Miss Universe Japan 2013 picked Leorio from Hunter x Hunter as her ideal anime man.",
    "fullText": "Yukimi Matsuo, Miss Universe Japan 2013, surprised anime fans by naming Leorio Paradinight from Hunter x Hunter as her ideal type. As an anime lover herself, her choice made headlines and showed just how much impact Leorio’s character has even outside anime circles.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_5.png"
  },
  {
    "id": "6",
    "anime": "Naruto",
    "title": "Anime Fact 6",
    "preview": "Naruto's official hobbies include pulling pranks and watering plants.",
    "fullText": "According to official data books, Naruto Uzumaki enjoys pulling pranks and watering plants. The prankster side fits his early personality, while the gardening shows a softer, more nurturing side to the future Hokage of Konoha.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_6.png"
  },
  {
    "id": "7",
    "anime": "Bleach",
    "title": "Anime Fact 7",
    "preview": "Tite Kubo never confirmed Ulquiorra’s death despite fan letters flooding in.",
    "fullText": "After Ulquiorra’s apparent death in Bleach, creator Tite Kubo received thousands of letters from fans. Interestingly, he never confirmed the Espada's fate, leaving Ulquiorra’s death ambiguous. This open-ended conclusion has fueled debates among fans for years.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_7.png"
  },
  {
    "id": "8",
    "anime": "One Piece",
    "title": "Anime Fact 8",
    "preview": "Oda redesigned Chopper to be smaller so he wouldn’t be overshadowed by the crew.",
    "fullText": "In One Piece, Chopper was originally designed as a tall reindeer, but Eiichiro Oda decided to make him shorter. This was to ensure he stood out among the already popular Straw Hat crew, helping Chopper develop a distinct and lovable character.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_8.png"
  },
  {
    "id": "9",
    "anime": "Hajime no Ippo",
    "title": "Anime Fact 9",
    "preview": "Ippo’s boxing trunks in Hajime no Ippo were handmade by his mother.",
    "fullText": "In Hajime no Ippo, the boxing trunks worn by Ippo Makunouchi were lovingly handmade by his mother. This detail reflects the strong family support behind his boxing career and gives emotional weight to his journey in the ring.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_9.png"
  },
  {
    "id": "10",
    "anime": "Attack on Titan",
    "title": "Anime Fact 10",
    "preview": "Carla said Eren’s ears turn red when he’s lying in Attack on Titan.",
    "fullText": "In Attack on Titan, Carla Jaeger once shared a fun fact: her son Eren’s ears turn red when he lies. This small but endearing character detail adds a humanizing touch to the often intense and dramatic world of the anime.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_10.png"
  },
  {
    "id": "11",
    "anime": "Sket Dance",
    "title": "Anime Fact 11",
    "preview": "Switch’s laptop voice is made from his own and his deceased brother’s voice.",
    "fullText": "In Sket Dance, Switch communicates using a synthesized voice through his laptop. What makes this voice special is that it combines his own voice with recordings of his late brother’s. This emotional tribute adds powerful depth to his quiet and tech-savvy persona.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_11.png"
  },
  {
    "id": "12",
    "anime": "Gintama",
    "title": "Anime Fact 12",
    "preview": "Gintama’s Sakata Gintoki can’t swim, as confirmed in Lesson 472 by Tama.",
    "fullText": "In Gintama Lesson 472, Tama confirms that Sakata Gintoki can’t swim. While it may come as a surprise, fans have seen subtle hints throughout the series-like Gintoki often wearing floaties in water scenes. This detail adds to his quirky and unpredictable personality, making him even more relatable and humorous to fans.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_12.png"
  },
  {
    "id": "13",
    "anime": "Dragon Ball",
    "title": "Anime Fact 13",
    "preview": "In Budokai Tenkaichi 3, Roshi tells Chi-Chi he never liked the Ox-King.",
    "fullText": "In the video game Dragon Ball Z: Budokai Tenkaichi 3, if Master Roshi faces off against Chi-Chi, he makes a surprising comment, saying he never liked the Ox-King, her father. While meant as a humorous pre-battle line, it adds a funny twist to the long-standing relationship between the characters in the Dragon Ball universe.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_13.png"
  },
  {
    "id": "14",
    "anime": "YuYu Hakusho",
    "title": "Anime Fact 14",
    "preview": "Togashi says the Toguro Brothers are his favorite villains for being unrestrained.",
    "fullText": "Yu Yu Hakusho creator Yoshihiro Togashi once revealed that the Toguro Brothers are his favorite villains in the series. He described them as 'fundamentally unrestrained,' meaning they represent raw power and a refusal to hold back, both physically and ideologically. Their intense presence and moral ambiguity made them standout antagonists in the Dark Tournament arc.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_14.png"
  },
  {
    "id": "15",
    "anime": "Pokemon",
    "title": "Anime Fact 15",
    "preview": "In Pokémon Yellow, Red’s Pikachu refuses to evolve and walks outside its Poké Ball.",
    "fullText": "In Pokémon Yellow, Red’s Pikachu was designed to mirror Ash Ketchum’s Pikachu from the anime. Like Ash’s companion, this Pikachu refuses to evolve and follows the player outside of its Poké Ball throughout the game. This unique behavior made Pokémon Yellow stand out and created a stronger connection between the anime and game series.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_15.png"
  },
  {
    "id": "16",
    "anime": "One Piece",
    "title": "Anime Fact 16",
    "preview": "Sanji’s left eye was revealed in Chapter 598, ending years of fan speculation.",
    "fullText": "In One Piece Chapter 598, following the two-year time skip, fans finally got a look at Sanji’s long-hidden left eye. Before this, his consistent hairstyle had always covered it, sparking countless fan theories and speculation. Its reveal may have been simple, but it symbolized a fresh start for the Straw Hats and put years of curiosity to rest.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_16.png"
  },
  {
    "id": "17",
    "anime": "Tokyo Ghoul",
    "title": "Anime Fact 17",
    "preview": "Kaneki touches his chin with his left hand when lying or feeling uneasy, like his mom.",
    "fullText": "In Tokyo Ghoul, Kaneki has a subtle tell, he touches his chin with his left hand whenever he’s lying or feeling uneasy. This small habit was inherited from his mother, as Hide explains to Touka in the series. It’s a quiet but powerful character detail that reflects Kaneki’s inner conflict and emotional depth.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_17.png"
  },
  {
    "id": "18",
    "anime": "The Seven Deadly Sins",
    "title": "Anime Fact 18",
    "preview": "Ban and Meliodas arm-wrestled 720 times, but they argue over who won more.",
    "fullText": "In The Seven Deadly Sins, Ban and Meliodas arm-wrestled a staggering 720 times. One of them claims to have 361 wins, but the two continue to argue over who actually came out on top. Their fierce rivalry and unbreakable friendship make this ongoing contest a fun and memorable detail in the series.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_18.png"
  },
  {
    "id": "19",
    "anime": "Mushibugyo",
    "title": "Anime Fact 19",
    "preview": "In Mushibugyo, four girls fall in love with Jinbei: Oharu, Hibachi, Kuroageha, and Irori.",
    "fullText": "In the anime Mushibugyo, Jinbei Tsukishima unintentionally captures the hearts of four different girls: Oharu, Hibachi, Kuroageha, and Irori. Each of them develops romantic feelings for him throughout the series, creating a subtle harem dynamic amid the action-packed, bug-slaying storyline. This adds a layer of charm and humor to Jinbei’s otherwise heroic and determined character.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_19.png"
  },
  {
    "id": "20",
    "anime": "Tamako Market",
    "title": "Anime Fact 20",
    "preview": "Tamako needs floaties to swim and stutters when giving speeches in Tamako Market.",
    "fullText": "In Tamako Market, Tamako Kitashirakawa has two endearing weaknesses, she can’t swim without using arm floaties, and she struggles to give a proper speech without stuttering. These traits highlight her shy and clumsy personality, making her a more relatable and lovable character throughout the slice-of-life series.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_20.png"
  },
  {
    "id": "21",
    "anime": "Detective Conan",
    "title": "Anime Fact 21",
    "preview": "Shinichi Kudo was featured in campaigns to promote law-abiding behavior in Japan.",
    "fullText": "Due to his widespread popularity, Shinichi Kudo from Detective Conan was used in official Japanese campaigns to promote law-abiding behavior. His role as a brilliant young detective made him an ideal figure to inspire trust in the justice system and encourage responsible conduct among the public, especially younger audiences.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_21.png"
  },
  {
    "id": "22",
    "anime": "Pokemon",
    "title": "Anime Fact 22",
    "preview": "Pikachu and Meowth have inverse Pokédex numbers 25 and 52 and are cat and mouse rivals.",
    "fullText": "In the Pokémon series, Pikachu and Meowth share a clever numerical connection. Their Pokédex numbers are inverses of each other, with Pikachu at 25 and Meowth at 52. This mirrors their natural rivalry, since Pikachu is based on a rodent and Meowth on a cat. Their ongoing clash is one of the most iconic hero and villain pairings in anime.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_22.png"
  },
  {
    "id": "23",
    "anime": "Kuroko's Basketball",
    "title": "Anime Fact 23",
    "preview": "Kise only pierced his left ear and joked he'd do the right one next time because it hurt.",
    "fullText": "In Kuroko's Basketball, Ryota Kise revealed that he only pierced his left ear because the pain was more intense than he expected. He joked that he would pierce the right one next time, highlighting his playful personality. This small detail adds a bit of charm to Kise's stylish and energetic character.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_23.png"
  },
  {
    "id": "24",
    "anime": "General Anime",
    "title": "Anime Fact 24",
    "preview": "Japan has close to 130 schools that specialize in training voice actors for anime.",
    "fullText": "Japan is home to nearly 130 schools dedicated to training aspiring voice actors for anime, video games, and other media. These institutions offer specialized courses in vocal technique, acting, and studio performance to prepare students for careers in the competitive voice acting industry. The high demand for talented seiyuu reflects the growing influence of anime both in Japan and around the world.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_24.png"
  },
  {
    "id": "25",
    "anime": "Fullmetal Alchemist",
    "title": "Anime Fact 25",
    "preview": "Roy Mustang compares his subordinates to chess pieces, calling himself the King.",
    "fullText": "In Fullmetal Alchemist, Roy Mustang refers to his team as chess pieces, each chosen for their unique abilities and value to his strategy. Fuery is the Pawn, Falman the Bishop, Havoc the Knight, Breda the Rook, and Hawkeye the Queen. Mustang places himself as the King, symbolizing both his leadership role and reliance on his team in battle and trust. This metaphor highlights the deep bonds and calculated tactics within his unit.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_25.png"
  },
  {
    "id": "124",
    "anime": "Gundam",
    "title": "Anime Fact 124",
    "preview": "Gundam was first called 'Gundom', mixing 'gun' and 'freedom' before the name changed.",
    "fullText": "The original name for the Gundam series was 'Gundom', blending 'gun' and 'freedom'. It was later changed to 'Gundam' to symbolize the giant robots as dams holding back enemies. This metaphor gave the series greater symbolic weight and helped define the mecha genre.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_124.png"
  },
  {
    "id": "125",
    "anime": "Akira",
    "title": "Anime Fact 125",
    "preview": "Akira used 50 original colors to achieve its iconic and revolutionary animation.",
    "fullText": "Akira is considered a milestone in anime history not only for its story but for its visuals. The creators developed 50 new colors specifically for the film, allowing it to achieve a unique cyberpunk style that continues to influence modern animation and sci-fi media.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_125.png"
  },
  {
    "id": "126",
    "anime": "Boku no Hero Academia",
    "title": "Anime Fact 126",
    "preview": "Yuga Aoyama was first called 'Can’t Stop Twinkle' with a different character design.",
    "fullText": "In My Hero Academia’s early development, Yuga Aoyama was originally called 'Can’t Stop Twinkle' and had slightly longer, less spiky hair. His hero name and look were eventually refined, enhancing his quirky personality and style in the final version of the anime.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_126.png"
  },
  {
    "id": "127",
    "anime": "One Piece",
    "title": "Anime Fact 127",
    "preview": "Zoro was originally meant to be in Buggy’s crew in early One Piece drafts.",
    "fullText": "Eiichiro Oda originally planned for Zoro to be part of Buggy the Clown’s pirate crew in One Piece. Early concept art showed Zoro working under Buggy, but Oda later made him Luffy’s first crewmate instead, shaping one of anime’s most iconic duos.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_127.png"
  }
]
