[

  {
    "id": "1",
    "anime": "One Piece",
    "title": "Anime Fact 1",
    "preview": "Luffy is so focused on becoming Pirate King, he only takes a bath once a week.",
    "fullText": "When you are the future Pirate King, things like taking regular showers are not exactly a top priority. Luffy is so focused on adventure, meat, and chasing the One Piece that he only takes a bath once a week. Yes, you read that right—once a week! Whether he is sailing the Grand Line, fighting warlords, or goofing off with his crew, hygiene is the least of his concerns. But hey, when you are made of rubber and powered by dreams, maybe you do not sweat the small stuff.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_1.png"
  },
  {
    "id": "2",
    "anime": "Fairy Tail",
    "title": "Anime Fact 2",
    "preview": "Gajeel writes good songs, but Gray says his singing and playing are pretty bad.",
    "fullText": "According to Gray, Gajeel is surprisingly a very good songwriter. However, his musical talents stop there—Gray also mentions that Gajeel is terrible at singing and playing instruments. While Gajeel has the heart of a rockstar, his skills clearly need some tuning. Still, it’s fun to imagine him rocking out off-key in the Fairy Tail guild hall.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_2.png"
  },
  {
    "id": "3",
    "anime": "YuYu Hakusho",
    "title": "Anime Fact 3",
    "preview": "Hiei and Kurama were once planned to be a couple, but became close friends instead.",
    "fullText": "Hiei and Kurama were originally intended to be in a romantic relationship in the early drafts of Yu Yu Hakusho. However, due to content restrictions and editorial concerns at the time, Yoshihiro Togashi changed their dynamic to a deep and loyal friendship instead. Despite the change, their bond remains one of the most compelling and enduring relationships in the series.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_3.png"
  },
  {
    "id": "4",
    "anime": "Pokemon",
    "title": "Anime Fact 4",
    "preview": "Vullaby is a Dark-type likely because it wears a broken human skull as a diaper.",
    "fullText": "The diaper-wearing Pokémon Vullaby is classified as a Dark type, and that might not be random. Its 'diaper' actually appears to be a broken human skull, hinting at a darker and more unsettling origin. This eerie design choice likely explains its typing and adds a layer of creepy mystery to an otherwise odd-looking Pokémon.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_4.png"
  },
  {
    "id": "5",
    "anime": "Hunter x Hunter",
    "title": "Anime Fact 5",
    "preview": "Miss Universe Japan 2013 said her ideal man is Leorio from Hunter x Hunter.",
    "fullText": "Miss Universe Japan 2013, Yukimi Matsuo, surprised fans when she revealed that her ideal type is none other than Leorio Paradinight from Hunter x Hunter. As a big anime fan herself, her choice shows just how beloved and relatable Leorio is—even to beauty queens!",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_5.png"
  },
  {
    "id": "6",
    "anime": "Naruto",
    "title": "Anime Fact 6",
    "preview": "Naruto’s official hobbies are pulling pranks and watering plants.",
    "fullText": "According to official character data, Naruto’s hobbies are pulling pranks and watering plants. While the prank part fits his mischievous personality, the plant-watering side shows a surprisingly calm and nurturing side to the future Hokage.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_6.png"
  },
  {
    "id": "7",
    "anime": "Bleach",
    "title": "Anime Fact 7",
    "preview": "Fans flooded Tite Kubo with letters about Ulquiorra, but he never confirmed his fate.",
    "fullText": "Tite Kubo reportedly received thousands of letters from fans reacting to Ulquiorra’s death in Bleach. Despite the overwhelming response, Kubo never officially confirmed whether the Espada truly died. Instead, he left Ulquiorra’s fate open to interpretation, allowing fans to decide for themselves what became of the fan-favorite character.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_7.png"
  },
  {
    "id": "8",
    "anime": "One Piece",
    "title": "Anime Fact 8",
    "preview": "Chopper was originally tall, but Oda made him shorter to balance the crew's spotlight.",
    "fullText": "Chopper’s original design was a tall, lanky, bipedal reindeer. However, Luffy, Zoro, Sanji, Nami, and Usopp were already too popular, and Oda couldn’t find a place for Chopper. Oda thought that if he had gone with that design, Chopper would have been upstaged by the other characterd, so he made him shorter instead.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_8.png"
  },
  {
    "id": "9",
    "anime": "Hajime no Ippo",
    "title": "Anime Fact 9",
    "preview": "Ippo’s iconic boxing trunks were lovingly handmade by his mother.",
    "fullText": "In Hajime no Ippo, Ippo’s boxing trunks hold special meaning—they were handmade by his mother. This personal touch symbolizes the support and love from his family, grounding Ippo’s fighting spirit not just in training, but in the values and care he grew up with.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_9.png"
  },
  {
    "id": "10",
    "anime": "Attack on Titan",
    "title": "Anime Fact 10",
    "preview": "Carla once said that Eren’s ears turn red whenever he’s lying.",
    "fullText": "In Attack on Titan, Carla Jaeger once revealed a quirky detail about her son—Eren’s ears turn red when he’s lying. It’s a small but charming trait that adds a bit of humanity to Eren’s complex character, especially in the early parts of the story.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_10.png"
  },
  {
    "id": "124",
    "anime": "Gundam",
    "title": "Anime Fact 124",
    "preview": "Gundam was first called 'Gundom', a mix of 'gun' and 'freedom', before it was renamed.",
    "fullText": "The iconic name 'Gundam' wasn’t the original title for the legendary mecha series. It was first called 'Gundom', blending the words 'gun' and 'freedom' to reflect its combat-focused themes. However, creators later changed the name to 'Gundam' to symbolize the robots as dams holding back enemy forces. This shift gave the series a more metaphorical depth, aligning the mobile suits with protectors rather than just weapons of war.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_124.png"
  },
  {
    "id": "125",
    "anime": "Akira",
    "title": "Anime Fact 125",
    "preview": "Akira used 50 original colors made just for the film to push animation boundaries.",
    "fullText": "Akira is not just a legendary anime film because of its story—it is a visual revolution. The creators designed 50 unique colors specifically for this movie, pushing the limits of animation during its time. From neon lights to post-apocalyptic cityscapes, every frame was crafted with groundbreaking detail. It is no surprise that Akira continues to influence modern animation, sci-fi, and cyberpunk visuals even decades later.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_125.png"
  },
  {
    "id": "126",
    "anime": "Boku no Hero Academia",
    "title": "Anime Fact 126",
    "preview": "Yuga Aoyama's original name was 'Can't Stop Twinkle' and his design was slightly different.",
    "fullText": "In the early stages of My Hero Academia's development, Yuga Aoyama's character design was already quite close to the final version we see today. The main differences included slightly longer, less spiky hair and a different choice of pants. Interestingly, his original hero name was going to be Can't Stop Twinkle, but it was later changed to Can't Stop Twinkling. These small tweaks helped fine-tune his flamboyant and quirky persona that fans know and love.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_126.png"
  },
  {
    "id": "127",
    "anime": "One Piece",
    "title": "Anime Fact 127",
    "preview": "Zoro was originally going to be part of Buggy the Clown’s crew in early One Piece drafts.",
    "fullText": "Before One Piece became the epic we know today, Eiichiro Oda had very different plans for Roronoa Zoro. In the early drafts, Zoro was originally going to be a member of Buggy the Clown's pirate crew. Concept art even showed him as a swordsman serving under Buggy, which would have completely changed the dynamic of the story. Luckily, Oda decided to make Zoro Luffy's first crewmate, setting the stage for one of the most iconic duos in anime history.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_127.png"
  }

]
