[
  {
    "id": "1",
    "anime": "One Piece",
    "title": "Luffy Only Bathes Once a Week According to Oda",
    "preview": "Luffy only bathes once a week, focusing on becoming the Pirate King.",
    "fullText": "In One Piece, Monkey D. Luffy only takes a bath once a week. Creator Eiichiro Oda shared this detail to highlight Luffy's carefree personality and unwavering focus on his dream of becoming the Pirate King.\n\nThis fun fact shows how Luffy prioritizes adventure over routine things like hygiene, which makes him even more charming and relatable in his wild journey across the seas.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_1.png"
  },
  {
    "id": "2",
    "anime": "Fairy Tail",
    "title": "Gajeel Writes Songs But Struggles with Singing",
    "preview": "Gajeel writes songs, but Gray says he can’t sing or play instruments well.",
    "fullText": "In Fairy Tail, it's revealed that Gajeel Redfox has a musical side. Gray Fullbuster mentions that Gajeel writes songs, showing a surprising layer to his tough personality.\n\nHowever, Gray also jokes that Gajeel's singing voice and instrumental skills aren't exactly top tier. Still, it adds a fun and unexpected twist to Gajeel's rough character image.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_2.png"
  },
  {
    "id": "3",
    "anime": "YuYu Hakusho",
    "title": "Hiei and Kurama Were Almost a Couple",
    "preview": "Hiei and Kurama were once planned to be a couple, not just friends.",
    "fullText": "During early drafts of YuYu Hakusho, creator Yoshihiro Togashi considered making Hiei and Kurama a romantic couple. The idea was eventually dropped due to editorial restrictions and a shift in story direction.\n\nInstead, their relationship became a deep, loyal friendship that fans admire to this day. Their bond remains one of the most emotionally compelling in the series.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_3.png"
  },
  {
    "id": "4",
    "anime": "Pokemon",
    "title": "Vullaby’s Diaper Is Actually a Broken Skull",
    "preview": "Vullaby wears a broken skull as a diaper, fitting its eerie Dark type.",
    "fullText": "In the Pokémon world, Vullaby stands out with its unusual design. This Dark-type bird Pokémon wears a broken skull as a diaper, which is both bizarre and symbolic.\n\nThe choice to include such a creepy visual ties into its typing and personality, making Vullaby one of the more memorable designs among baby Pokémon.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_4.png"
  },
  {
    "id": "5",
    "anime": "Hunter x Hunter",
    "title": "Miss Universe Japan Chose Leorio as Her Ideal Anime Man",
    "preview": "Miss Universe Japan picked Leorio from Hunter x Hunter as her anime crush.",
    "fullText": "Yukimi Matsuo, Miss Universe Japan 2013, surprised fans when she picked Leorio Paradinight as her ideal anime man. Her love for anime was already known, but her specific choice caught attention.\n\nLeorio’s mix of humor, heart, and ambition clearly left an impression, proving his appeal even beyond the Hunter x Hunter fanbase.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_5.png"
  },
  {
    "id": "6",
    "anime": "Naruto",
    "title": "Naruto’s Hobbies Include Pranks and Watering Plants",
    "preview": "Naruto loves pulling pranks and quietly enjoys watering plants too.",
    "fullText": "According to official Naruto data books, Naruto Uzumaki has two main hobbies. He’s famously known for pulling pranks on villagers, especially in his younger days. But what might surprise fans is that he also enjoys watering plants.\n\nThis contrast shows the depth of Naruto’s personality—a playful troublemaker on one side, and a calm, caring soul on the other. It’s a small but meaningful detail about the future Hokage.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_6.png"
  },
  {
    "id": "7",
    "anime": "Bleach",
    "title": "Ulquiorra’s Death Was Never Fully Confirmed",
    "preview": "Tite Kubo left Ulquiorra’s death unconfirmed despite fan letters.",
    "fullText": "After Ulquiorra’s dramatic ending in Bleach, fans flooded creator Tite Kubo with letters asking about his fate. Interestingly, Kubo never gave a solid answer about whether Ulquiorra truly died.\n\nThis silence sparked years of debate, keeping Ulquiorra’s legacy alive in the fandom. His ambiguous end still haunts fans in the best way.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_7.png"
  },
  {
    "id": "8",
    "anime": "One Piece",
    "title": "Oda Made Chopper Smaller to Stand Out",
    "preview": "Oda made Chopper smaller so he wouldn’t be overshadowed by the crew.",
    "fullText": "Tony Tony Chopper was originally designed as a large reindeer in One Piece. However, Eiichiro Oda decided to shrink his size during development. The reason? To keep him visually unique and not get overshadowed by the larger, louder personalities in the Straw Hat crew.\n\nThis design change helped Chopper stand out and become a fan-favorite mascot full of heart and charm.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_8.png"
  },
  {
    "id": "9",
    "anime": "Hajime no Ippo",
    "title": "Ippo’s Boxing Trunks Were Handmade by His Mom",
    "preview": "Ippo’s trunks were made by his mother, adding emotion to each fight.",
    "fullText": "In Hajime no Ippo, Ippo Makunouchi’s iconic boxing trunks weren’t store-bought—they were hand-sewn by his mother. This heartfelt detail emphasizes the emotional bond between mother and son.\n\nEvery time Ippo steps into the ring, he carries a piece of home and family support with him. It’s a powerful symbol of love and sacrifice behind his strength.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_9.png"
  },
  {
    "id": "10",
    "anime": "Attack on Titan",
    "title": "Eren’s Ears Turn Red When He’s Lying",
    "preview": "Carla said Eren’s ears turn red when he lies in Attack on Titan.",
    "fullText": "In a touching moment from Attack on Titan, Carla Jaeger reveals that Eren’s ears turn red when he’s lying. It’s a charming bit of character trivia that fans love.\n\nThis subtle trait adds a more human and vulnerable side to Eren, especially when contrasted with the intense and often tragic journey he faces later in the series.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_10.png"
  },
  {
    "id": "11",
    "anime": "Sket Dance",
    "title": "Switch’s Laptop Voice Is Made From Two People",
    "preview": "Switch’s voice mixes his own and his late brother’s recordings.",
    "fullText": "In Sket Dance, the character Switch uses a synthesized voice on his laptop to communicate. But what makes it so emotional is that it combines his own voice with that of his deceased brother.\n\nThis touching tribute gives his silence deep meaning, making Switch one of the most emotionally complex characters in the show.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_11.png"
  },
  {
    "id": "12",
    "anime": "Gintama",
    "title": "Sakata Gintoki Can’t Swim",
    "preview": "Tama confirmed in Lesson 472 that Gintoki can’t swim.",
    "fullText": "In Lesson 472 of Gintama, Tama reveals that Sakata Gintoki cannot swim. While it’s played for laughs, the show has dropped hints—like Gintoki wearing floaties or avoiding deep water scenes.\n\nIt adds yet another hilarious contradiction to Gintoki’s over-the-top samurai persona, keeping fans entertained with his many quirks.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_12.png"
  },
  {
    "id": "13",
    "anime": "Dragon Ball",
    "title": "Roshi Told Chi-Chi He Never Liked the Ox-King",
    "preview": "In a DBZ game, Roshi told Chi-Chi he disliked her father.",
    "fullText": "In Dragon Ball Z: Budokai Tenkaichi 3, Master Roshi has a unique pre-fight dialogue with Chi-Chi. He casually says he never liked the Ox-King, her father.\n\nWhile it’s a funny and unexpected line, it adds a bit of spice to their long-standing character dynamics from the classic Dragon Ball series.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_13.png"
  },
  {
    "id": "14",
    "anime": "YuYu Hakusho",
    "title": "Toguro Brothers Are Togashi’s Favorite Villains",
    "preview": "Togashi loves the Toguro Brothers for being totally unrestrained.",
    "fullText": "Yoshihiro Togashi, creator of YuYu Hakusho, once said the Toguro Brothers are his favorite villains in the series. He described them as fundamentally unrestrained, both in power and philosophy.\n\nTheir fierce presence and no-holds-barred attitude helped define the intensity of the Dark Tournament arc and left a lasting impression on fans.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_14.png"
  },
  {
    "id": "15",
    "anime": "Pokemon",
    "title": "Red’s Pikachu Was Modeled After Ash’s Companion",
    "preview": "In Pokémon Yellow, Pikachu refuses to evolve and walks beside you.",
    "fullText": "In Pokémon Yellow, Red’s Pikachu is designed to mirror Ash’s Pikachu from the anime. It refuses to evolve and follows the player around instead of staying in its Poké Ball.\n\nThis design choice helped bridge the gap between the anime and the game, making Yellow version feel like you were living Ash’s story.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_15.png"
  },
  {
    "id": "16",
    "anime": "One Piece",
    "title": "Sanji’s Left Eye Was Revealed After the Time Skip",
    "preview": "Chapter 598 finally showed Sanji’s left eye after years of mystery.",
    "fullText": "In One Piece Chapter 598, fans finally got to see Sanji’s long-hidden left eye for the first time. Until then, it had always been covered by his iconic hairstyle, sparking endless fan theories about what it might be hiding.\n\nThe reveal marked a symbolic fresh start for Sanji and the Straw Hat crew after the two-year time skip, satisfying years of speculation from fans.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_16.png"
  },
  {
    "id": "17",
    "anime": "Tokyo Ghoul",
    "title": "Kaneki’s Nervous Habit Came From His Mother",
    "preview": "Kaneki touches his chin when lying, a habit from his mom.",
    "fullText": "In Tokyo Ghoul, Ken Kaneki has a nervous habit of touching his chin with his left hand whenever he lies or feels uneasy. This subtle gesture is more than just a quirk—it’s something he inherited from his mother.\n\nHide explains this detail to Touka, giving fans a deeper understanding of Kaneki’s emotional behavior and the trauma shaping his character.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_17.png"
  },
  {
    "id": "18",
    "anime": "The Seven Deadly Sins",
    "title": "Ban and Meliodas Arm-Wrestled 720 Times",
    "preview": "Ban and Meliodas wrestled 720 times but debate who won more.",
    "fullText": "In The Seven Deadly Sins, Ban and Meliodas have arm-wrestled a jaw-dropping 720 times. One of them claims to have 361 wins, but the two can never agree on who’s actually ahead.\n\nThis hilarious rivalry is a testament to their competitive spirit and close friendship, becoming one of the show’s most amusing running jokes.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_18.png"
  },
  {
    "id": "19",
    "anime": "Mushibugyo",
    "title": "Four Girls Fall in Love With Jinbei",
    "preview": "Oharu, Hibachi, Kuroageha, and Irori all love Jinbei.",
    "fullText": "In Mushibugyo, Jinbei Tsukishima finds himself at the center of multiple love interests. Throughout the series, four different girls—Oharu, Hibachi, Kuroageha, and Irori—fall for him.\n\nThis subplot adds a romantic twist to the action-heavy story, making Jinbei’s journey not just heroic, but also hilariously charming and unpredictable.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_19.png"
  },
  {
    "id": "20",
    "anime": "Tamako Market",
    "title": "Tamako Can’t Swim and Struggles With Speeches",
    "preview": "Tamako needs floaties and stutters during speeches.",
    "fullText": "In Tamako Market, Tamako Kitashirakawa has two cute struggles—she can’t swim without floaties and she stutters when giving speeches. These traits reveal her shy and slightly clumsy personality.\n\nFar from being flaws, these quirks make her even more relatable and loveable to fans who enjoy wholesome, slice-of-life stories.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_20.png"
  },
  {
    "id": "21",
    "anime": "Detective Conan",
    "title": "Shinichi Was Chosen to Promote Law and Justice in Japan",
    "preview": "Shinichi was featured in real-world campaigns encouraging law-abiding behavior.",
    "fullText": "Shinichi Kudo’s reputation as a brilliant high school detective in Detective Conan made him an ideal role model. His calm intellect and unwavering pursuit of truth led Japanese officials to use his image in national campaigns to promote law-abiding behavior, especially to younger audiences.\n\nThese campaigns aimed to build public trust in the justice system by connecting with fans through a beloved fictional hero. It’s a powerful example of how anime characters can positively impact real-world behavior and public awareness.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_21.png"
  },
  {
    "id": "22",
    "anime": "Pokemon",
    "title": "Pikachu and Meowth Share a Hidden Number Connection",
    "preview": "Their Pokédex numbers 25 and 52 are clever inverses with cat and mouse roots.",
    "fullText": "Pikachu and Meowth are more than just rivals in Pokémon lore. Their Pokédex numbers, 25 and 52, are numerical inverses, hinting at their opposing natures. Pikachu represents the mouse while Meowth takes the role of the cat, making them natural enemies both symbolically and narratively.\n\nThis clever detail highlights the playful design choices behind the franchise. Their never-ending feud in the anime adds humor and charm, reinforcing their iconic status as one of anime’s most memorable duos.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_22.png"
  },
  {
    "id": "23",
    "anime": "Kuroko's Basketball",
    "title": "Kise Only Pierced One Ear and Joked About the Other",
    "preview": "Kise said the pain from piercing one ear was enough for now.",
    "fullText": "Ryota Kise, the stylish model and basketball prodigy from Kuroko's Basketball, once revealed a quirky personal detail. He only pierced his left ear and joked that the pain was intense enough to stop him from doing the right one—for now.\n\nThis small comment showcases Kise’s playful and expressive personality. It’s a fun behind-the-scenes tidbit that fans love, adding another layer to his confident yet sometimes dramatic charm.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_23.png"
  },
  {
    "id": "24",
    "anime": "General Anime",
    "title": "Japan Has Nearly 130 Schools for Aspiring Voice Actors",
    "preview": "Voice acting is so important that over 100 schools exist just to teach it.",
    "fullText": "In Japan, the anime industry values voice acting so highly that there are nearly 130 specialized schools dedicated to it. These institutions train aspiring seiyuu in vocal performance, acting, and sound studio techniques to prepare them for careers in anime, games, and dubbing.\n\nThe popularity of voice actors continues to grow, with some gaining celebrity-level fame. This massive support network shows how central voice acting is to anime’s success and cultural influence.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_24.png"
  },
  {
    "id": "25",
    "anime": "Fullmetal Alchemist",
    "title": "Roy Mustang Sees His Team Like a Chessboard",
    "preview": "Mustang compares each of his allies to a chess piece in battle strategy.",
    "fullText": "In Fullmetal Alchemist, Colonel Roy Mustang uses a unique metaphor to describe his relationship with his team. He assigns each member a role on a chessboard—Fuery is the Pawn, Falman the Bishop, Havoc the Knight, Breda the Rook, and Hawkeye the Queen. Mustang himself plays the role of the King.\n\nThis metaphor reflects his strategic mind and the deep trust he places in his comrades. It also emphasizes how each member’s individual skills contribute to the team’s strength and success in high-stakes military operations.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_25.png"
  },
  {
    "id": "26",
    "anime": "Shaman King",
    "title": "The Meaning Behind Ren’s Real Name Will Surprise You",
    "preview": "Ren’s real name, Lian, means lotus and is often considered a girl’s name.",
    "fullText": "In Shaman King, Tao Ren’s name holds deeper meaning than most fans realize. The name Ren reflects traits like being benevolent and sharp, perfectly matching his serious nature and combat talent. But his actual given name is Lian, a Chinese word meaning lotus, which is more commonly used for girls.\n\nThis choice of name adds contrast to his tough, proud personality. The lotus is a symbol of beauty and strength rising from difficulty, and this mirrors Ren’s journey throughout the series. It hints at a side of him that values growth and resilience, even if it isn’t always visible. The name Lian gives more emotional depth to his character and highlights the thoughtful design behind him.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_26.png"
  },
  {
    "id": "27",
    "anime": "Fairy Tail",
    "title": "Mirajane Secretly Helps Others Enter Lucy’s Home",
    "preview": "Mirajane keeps a spare key to Lucy's house and shares it with others.",
    "fullText": "In Fairy Tail, Mirajane Strauss quietly plays a role in the frequent intrusions into Lucy Heartfilia’s home. She holds a spare key to Lucy’s place and doesn’t hesitate to hand it over to other guild members, especially Natsu and Happy, whenever they want to drop by unannounced.\n\nThis explains why Lucy often finds her friends inside her house without any warning. While it’s usually played for laughs, this running gag also reflects the close-knit, chaotic nature of the Fairy Tail guild. Mirajane’s involvement adds a subtle layer to her character as someone who supports everyone behind the scenes, even in lighthearted ways. It’s a small detail that highlights both the humor and the bond between guildmates.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_27.png"
  },
  {
    "id": "28",
    "anime": "One Piece",
    "title": "Shanks Lost His Arm Because of an Editor’s Suggestion",
    "preview": "Oda revealed Shanks lost his arm due to an editor's advice for more drama.",
    "fullText": "In a 2010 interview, One Piece creator Eiichiro Oda shared an interesting behind-the-scenes fact about Shanks. Originally, Shanks was not supposed to lose his arm during the early chapters of the series. However, one of Oda’s editors suggested the change to add more emotional weight and make the story feel more dramatic from the start.\n\nTaking that advice, Oda rewrote the scene where Shanks saves Luffy from the Sea King by sacrificing his arm. This moment became a defining part of One Piece and helped shape Luffy’s motivation and respect for Shanks. It’s a small editorial suggestion that ended up leaving a lasting impact on the tone of the entire series.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_28.png"
  },
  {
    "id": "29",
    "anime": "Yu Yu Hakusho",
    "title": "Hiei Was Originally Meant to Be a Minor Villain",
    "preview": "Hiei was supposed to be a short-term villain, but fans changed his fate.",
    "fullText": "In Yu Yu Hakusho, Hiei was initially written to appear as a minor antagonist early in the series. His debut was meant to be brief, serving as an obstacle for the main characters before fading from the story. However, his unique design, cold personality, and mysterious background quickly captured the attention of fans.\n\nDue to overwhelming popularity, the creators decided to keep Hiei in the story and gradually developed him into one of the core members of Yusuke’s team. His evolution from a sharp-tongued villain to a loyal and powerful ally became one of the show’s most memorable character arcs. Hiei’s shift in role is a clear example of how fan response can influence the direction of a series.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_29.png"
  },
  {
    "id": "30",
    "anime": "My Hero Academia",
    "title": "The Meaning Behind Uraraka Ochaco’s Name",
    "preview": "Uraraka means bright and beautiful, while Ochaco means tea child.",
    "fullText": "In My Hero Academia, the name of Ochaco Uraraka holds gentle and thoughtful meanings. Her family name, Uraraka, can be translated as bright and beautiful, evoking a calm and positive image that reflects her kind and cheerful personality. Her given name, Ochaco, translates to tea child in Japanese, a phrase that feels warm, simple, and nurturing.\n\nThese meanings match Ochaco’s down-to-earth charm and her background growing up in a humble, loving family. The ‘tea child’ imagery suits her grounded nature and desire to help others, especially her dream of supporting her parents financially. Together, her names form a fitting reflection of who she is both as a person and as a hero in training.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_30.png"
  },
  {
    "id": "31",
    "anime": "Dragon Ball Super",
    "title": "Jiren Was Originally Meant to Be More Outspoken",
    "preview": "Jiren was planned to be outspoken, but Toriyama made him a quiet figure.",
    "fullText": "In Dragon Ball Super, Jiren was originally designed to have a more vocal and expressive personality. Early drafts from Toei Animation portrayed him as an outspoken warrior who would frequently voice his thoughts and challenge others with bold declarations. However, Akira Toriyama decided to change this direction during development.\n\nInstead of giving Jiren that role, Toriyama shifted the more expressive traits to Toppo, Jiren’s fellow Pride Trooper. This allowed Jiren to become a quiet, stoic figure with a tragic backstory that fueled his strength. His silence made his presence more intimidating and mysterious, giving him a different kind of depth. The decision added contrast to the team dynamic and made Jiren’s moments of emotion stand out even more.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_31.png"
  },
  {
    "id": "32",
    "anime": "Dragon Ball Z",
    "title": "Future Trunks Once Admitted Android 18 Was Cute",
    "preview": "Trunks said if Android 18 weren't evil, he'd probably think she was cute.",
    "fullText": "In Dragon Ball Z, Future Trunks revealed an unexpected thought during his encounters with the androids. Despite the destruction Android 18 caused in his timeline, Trunks once admitted that if she weren’t evil, he would actually find her cute. This comment came as a surprise, especially given the pain and chaos she brought to his future.\n\nTrunks’ remark shows a rare lighthearted moment from a usually serious character. It also highlights how different 18's personality was across timelines. In the main timeline, she eventually becomes a hero and even starts a family with Krillin. The contrast between how Trunks saw her and who she became adds an interesting layer to her character and shows how circumstances can shape someone’s path.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_32.png"
  },
  {
    "id": "33",
    "anime": "Fairy Tail",
    "title": "Erza’s Original Design Was Wildly Different",
    "preview": "Erza was first imagined with a spear, a bird companion, and a wilder look.",
    "fullText": "In early concept art for Fairy Tail, Erza Scarlet looked very different from the strong, armored warrior fans know today. She was initially designed with a wild appearance, carrying a spear instead of swords and accompanied by a bird companion. Her look was rougher and more untamed, meant to give off an intimidating presence.\n\nCreator Hiro Mashima originally planned for Erza to be someone even Natsu feared. Over time, her design evolved into the composed and powerful knight with a strong moral compass. While the spear and bird were dropped, the intensity and authority from her early concept remained. These changes helped shape Erza into a balanced mix of strength, grace, and discipline—making her one of the most respected characters in the guild.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_33.png"
  },
  {
    "id": "34",
    "anime": "Hunter x Hunter",
    "title": "Killua’s Favorite Snack Is a Real Brand of Chocolate",
    "preview": "Killua loves ChocoRobo-kun chocolate balls and eats them often in the series.",
    "fullText": "In Hunter x Hunter, Killua Zoldyck has a major sweet tooth, and his favorite snack is ChocoRobo-kun chocolate balls. He’s often seen munching on them throughout the series, especially during casual moments or while traveling with Gon. The snack became closely associated with his character, adding a fun and relatable detail to his otherwise deadly assassin background.\n\nChocoRobo-kun isn’t just a random prop—it’s actually a parody of real Japanese chocolate snacks, giving fans a familiar cultural touchpoint. This small detail adds charm to Killua’s personality, showing that despite his dark past and intense abilities, he’s still a kid at heart. It also gives viewers light moments that balance out the series’ darker themes.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_34.png"
  },
  {
    "id": "35",
    "anime": "One Piece",
    "title": "Zoro Was the Only Straw Hat Luffy Planned to Recruit",
    "preview": "Zoro was Luffy’s only crew member he planned to recruit from the start.",
    "fullText": "In One Piece, Roronoa Zoro holds a unique place among the Straw Hat crew. He is the only member that Luffy actively sought out and intended to recruit even before they met. Most of Luffy’s crew members joined him through chance encounters or as a result of shared experiences, but Zoro was different.\n\nLuffy had already heard of Zoro’s strength and reputation as a swordsman and made up his mind to have him as the first addition to his pirate crew. This decision set the tone for their bond and Zoro’s role as the crew’s loyal swordsman and unofficial right hand. It shows Luffy’s eye for strong allies and highlights the respect he had for Zoro even before they exchanged words.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_35.png"
  },
  {
    "id": "124",
    "anime": "Gundam",
    "title": "Gundam Was Almost Named Gundom Before a Last-Minute Change",
    "preview": "It was first named Gundom, mixing 'gun' and 'freedom', before becoming Gundam.",
    "fullText": "The legendary Gundam franchise almost had a very different name. It was originally called 'Gundom', blending the words 'gun' and 'freedom' to reflect the series' themes. However, the name was changed to 'Gundam' to represent a barrier holding back the chaos of war, like a dam.\n\nThis shift gave the name symbolic meaning and helped solidify Gundam’s identity as a thoughtful mecha series. That subtle change turned out to be crucial in shaping the brand’s legacy and impact.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_124.png"
  },
  {
    "id": "125",
    "anime": "Akira",
    "title": "Akira Used 50 Original Colors to Revolutionize Anime",
    "preview": "To achieve its look, Akira created 50 colors not found in other anime.",
    "fullText": "Akira wasn’t just a storytelling milestone—it redefined anime visuals forever. The creators developed 50 brand-new colors exclusively for the film, allowing for rich cityscapes, vivid lighting, and detailed character designs that pushed the limits of traditional animation.\n\nThese innovations helped Akira capture the gritty, neon-drenched atmosphere of a cyberpunk future. Its bold aesthetic still influences animation, fashion, and science fiction decades after its release.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_125.png"
  },
  {
    "id": "126",
    "anime": "Boku no Hero Academia",
    "title": "Yuga Aoyama Was First Named Can’t Stop Twinkle",
    "preview": "Aoyama was once called Can’t Stop Twinkle with a totally different character look.",
    "fullText": "In the early concept phase of My Hero Academia, Yuga Aoyama had a different hero name—Can’t Stop Twinkle. His character design also looked different, with longer, less spiky hair and a more flamboyant vibe that hadn’t yet been refined for the anime.\n\nAs development progressed, the name and style were toned down to better balance his quirky personality with the tone of the show. These changes helped shape Aoyama into the sparkly and awkward hero fans know today.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_126.png"
  },
  {
    "id": "127",
    "anime": "One Piece",
    "title": "Zoro Was Almost Part of Buggy’s Crew in Early Drafts",
    "preview": "Oda originally planned Zoro as a swordsman under Buggy in One Piece.",
    "fullText": "Before finalizing the story of One Piece, Eiichiro Oda had a different path in mind for Roronoa Zoro. Early drafts showed Zoro as a pirate working under Buggy the Clown, which would’ve placed him on the opposite side of the story’s main crew.\n\nThankfully, Oda changed course and introduced Zoro as Luffy’s first crewmate. That decision helped define the Straw Hat dynamic and gave fans one of the most loyal and iconic swordsmen in all of anime.",
    "image": "https://res.cloudinary.com/dwcryn9sr/image/upload/w_auto,c_limit,q_auto,f_auto/af_127.png"
  }
]
